{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_5", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "batch_input_shape": [null, 101, 1000, 1], "dtype": "float32", "filters": 32, "kernel_size": [2, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "filters": 32, "kernel_size": [2, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_9", "trainable": true, "pool_size": [4, 3], "padding": "valid", "strides": [4, 3], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "filters": 96, "kernel_size": [2, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "filters": 96, "kernel_size": [2, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_10", "trainable": true, "pool_size": [4, 3], "padding": "valid", "strides": [4, 3], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "sigmoid"}}]}}, "training_config": {"optimizer_config": {"class_name": "Adadelta", "config": {"lr": 1.0, "rho": 0.95, "decay": 0.0, "epsilon": 1e-07}}, "loss": "binary_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of16.bin", "group1-shard2of16.bin", "group1-shard3of16.bin", "group1-shard4of16.bin", "group1-shard5of16.bin", "group1-shard6of16.bin", "group1-shard7of16.bin", "group1-shard8of16.bin", "group1-shard9of16.bin", "group1-shard10of16.bin", "group1-shard11of16.bin", "group1-shard12of16.bin", "group1-shard13of16.bin", "group1-shard14of16.bin", "group1-shard15of16.bin", "group1-shard16of16.bin"], "weights": [{"name": "conv2d_17_1/kernel", "shape": [2, 3, 1, 32], "dtype": "float32"}, {"name": "conv2d_17_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_18_1/kernel", "shape": [2, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_18_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_19_1/kernel", "shape": [2, 3, 32, 96], "dtype": "float32"}, {"name": "conv2d_19_1/bias", "shape": [96], "dtype": "float32"}, {"name": "conv2d_20_1/kernel", "shape": [2, 3, 96, 96], "dtype": "float32"}, {"name": "conv2d_20_1/bias", "shape": [96], "dtype": "float32"}, {"name": "dense_13_1/kernel", "shape": [63936, 256], "dtype": "float32"}, {"name": "dense_13_1/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_14_1/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "dense_14_1/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_15_1/kernel", "shape": [256, 1], "dtype": "float32"}, {"name": "dense_15_1/bias", "shape": [1], "dtype": "float32"}]}]}